const childrenBooks = [{
  "id": "e5e953413hha",
  "title": "崔玉涛讲给孩子的身体健康书（套装6册）",
  "img_url": "http://img3m5.ddimg.cn/62/36/27886085-1_l_2.jpg",
  "price": "¥171.00"
}, {
  "id": "809bd5eij80d",
  "title": "柯林斯幼儿英语单词启蒙",
  "img_url": "http://img3m8.ddimg.cn/24/1/27923568-1_l_3.jpg",
  "price": "¥148.50"
}, {
  "id": "f5975gci52egb",
  "title": "小读客·梅格时空大冒险（套装全5册）（含《时间的折皱》[又名《时间的皱折》《时间的皱纹》]、《银河的裂缝》等）",
  "img_url": "http://img3m4.ddimg.cn/78/32/25099944-1_l_12.jpg",
  "price": "¥149.60"
}, {
  "id": "fc7a73c43jjb",
  "title": "皇家兔",
  "img_url": "http://img3m0.ddimg.cn/62/24/27893510-1_l_5.jpg",
  "price": "¥78.40"
}, {
  "id": "868aej3bf1f9f",
  "title": "迷人的逻辑思维游戏书（全3册）",
  "img_url": "http://img3m1.ddimg.cn/19/4/27903961-1_l_5.jpg",
  "price": "¥103.50"
}, {
  "id": "je3291j8ghcf8",
  "title": "曹文轩文集精装典藏礼盒版",
  "img_url": "http://img3m5.ddimg.cn/56/32/25300595-1_l_33.jpg",
  "price": "¥298.50"
}, {
  "id": "e0jg72ja146c7",
  "title": "古灵精怪小安娜：全11册",
  "img_url": "http://img3m5.ddimg.cn/44/26/27903095-1_l_8.jpg",
  "price": "¥148.50"
}, {
  "id": "654j546629d14",
  "title": "北斗儿童地理百科全书?世界地理地图+中国地理地图（套装2册",
  "img_url": "http://img3m4.ddimg.cn/70/9/27919654-1_l_9.jpg",
  "price": "¥207.00"
}, {
  "id": "9f6177a9h5e0f",
  "title": "藏在地图里的系列",
  "img_url": "http://img3m0.ddimg.cn/77/28/27868280-1_l_17.jpg",
  "price": "¥412.50"
}, {
  "id": "f9jhcj89aaj8e",
  "title": "10个我喜欢你的理由：全6册",
  "img_url": "http://img3m9.ddimg.cn/14/10/27914549-1_l_5.jpg",
  "price": "¥134.10"
}]

const technology = [{
  "id": "61g343246c0g7",
  "title": "JavaScript权威指南（第6版）（淘宝前端团队倾情翻译！经典权威的JavaScript犀牛书！第6版特别涵盖了H 经典的JavaScript犀牛书！第6版特别涵盖了HTML5和ECMAScript5！",
  "desc": "经典权威的JavaScript工具书 本书是程序员学习核心JavaScript语言和由Web浏览器定义的JavaScript API的指南和综合参考手册。 第6版涵盖HTML5和ECMAScript5 相关阅读 编写高质量代码：改善C程序代码的125个建议 JavaScript编程精解（原书第2版） Effective Python：编写高质量Python代码的59个有效方法 Effective Ruby：改善Ruby程序的48条建议",
  "img_url": "http://img3m0.ddimg.cn/13/17/22722790-1_b_6.jpg",
  "price": "¥133.40"
}, {
  "id": "187g4b46308c9",
  "title": "JavaScript高级程序设计(第3版)(JavaScript技术名著，html+css+javascript教程精 【图灵程序设计丛书】前端开发经典图书 JavaScript技术名著 web前端开发国内js一书 掌握JavaScript编程艺术",
  "desc": "1995年，Brendan Eich创造了JavaScript。 2005年，席卷全球的 Ajax热 激发了全世界Web开发人员学习JavaScript的热情。与此同时，本书第1版诞生。这一版的中文版狂销4万册，被誉为 *深度的JavaScript经典 ，奠定了其不可替代的权威地位。 2005年到2009年，前端开发社区在实践中充分检验了这门语言的各种实现和扩展，JavaScript从被戏谑的 玩具语言 一跃成为软件业举足轻重的通用编程语言。2009年1月本书第2版应运而生，凝聚作者和社区专家多年宝贵经验的这一技术名著再次得到读者认可和褒扬，中文版销量达到2万册。 2009年到2011年，ECMAScript5和HTML5在标准之争中双双胜出，使大量专有实现和客户端扩展正式进入规范，同时也为这门语言增添了很多适应未来发展的新特性。2012年初本书第3版面世，中文版也紧随其后。第3版除增加5章全新内容外，其他章节也有较大幅度的增补和修",
  "img_url": "http://img3m3.ddimg.cn/2/21/22628333-1_b_2.jpg",
  "price": "¥78.20"
}, {
  "id": "00fec21a4ic1df",
  "title": "JavaScript DOM编程艺术(第2版)（html+css+javascript教程精粹，JavaScrip权威 【图灵程序设计丛书】畅销书升级版 详解开发Web应用的基石 W3C的DOM标准 国际知名web设计师 倡导Web标准的领军人物执笔 揭示了前端开发的真谛",
  "desc": "超级畅销书升级版，首版销量保证。 书中详解开发Web应用的基石 W3C的DOM标准，由倡导Web标准的大牛领军人物执笔精心撰写，揭示了前端开发的真谛，是学习JavaScript和DOM开发的必读之作。 纵情释放JavaScript和DOM编程的惊人潜力，内容全年涵盖HTML5、jQuery。",
  "img_url": "http://img3m1.ddimg.cn/23/5/21049601-1_b_2.jpg",
  "price": "¥46.60"
}, {
  "id": "af60i8hf7469",
  "title": "JavaScript从入门到精通（标准版） JavaScript高级程序设计视频讲解，web开发核心技术案例实战，8大 扫一扫随时随地看视频 512节同步视频 1016个案例分析 1000道习题面试题 4396个案例 47部参考手册 1636个模版 17类素材库 623项配色 508项欣赏库 10年经验 网页制作 网页",
  "desc": "10年开发教学经验，一线讲师倾力打造。同属于JavaScript高级程序设计 JavaScript权威指南 JavaScript DOM 本JavaScript语言精粹 JavaScript算法 JavaScript入门 JavaScript实战 JavaScript设计模式大类。 1． 体验好。 几乎每个章节都有二维码，微信扫一扫，可以随时随地看视频。 2． 资源多 从配套到拓展，资源库一应俱全。除了512节配套微视频和1016个实例案例外。还提供如下学习资源： （1）习题及面试题库（共计1000题） （2）案例库（各类案例4396个） （3）工具库（HTML参考手册11部、CSS参考手册10部、JavaScript参考手册26部） （4）网页模板库（各类模板1636个） （5）网页素材库（17大类） （6）网页配色库（623项） （7）网页欣赏案例库（共计508例） 3．案例多 实例案例丰富详尽，达到1016个，边做边学更快捷。跟着大量案例去学习，边学边做，从做中学，学",
  "img_url": "http://img3m4.ddimg.cn/23/30/25108304-1_b_5.jpg",
  "price": "¥79.00"
}, {
  "id": "8jg3a904967g5",
  "title": "JavaScript语言精粹（修订版） JS传奇|Json之父老道扛鼎名著 BAT前端岗前培训保留书目",
  "desc": "□ 淘宝|口碑UED老大经典译作 □ JS水平与本书翻阅次数正相关 学习、理解、实践大师的思想，我们才有可能站在巨人的肩上，才有机会赶超大师，这本书就是开始。 这是一本介绍JavaScript语言本质的重要书籍，值得任何正在或者想从事JavaScript开发的人阅读，并且非常需要反复阅读。 如果说犀牛展现了 JavaScript 特性的丰富和功能的强大，蝴蝶（书）则完美诠释了 JavaScript 语言轻巧简洁的特点。 它是一本很好的帮助你提高 JavaScript 水平的书籍，因为总结也是学习的重要过程。 信息密度如此之大，却毫不啰嗦，适合已有一门语言功底的人快速掌握JavaScript中值得学习和使用的部分，恰当而又全面。",
  "img_url": "http://img3m4.ddimg.cn/23/2/22872884-1_b_10.jpg",
  "price": "¥46.60"
}, {
  "id": "ja024e54h1586",
  "title": "HTML5+CSS3+JavaScript从入门到精通（标准版） web开发技术基础视频讲解与案例实战，8大素材库、源 10万读者检验 扫一扫随时随地看视频 412节同步视频 661个案例分析 1000习题面试题 4396个案例 47部参考手册 1636个模版 17类素材库 623项配色 508项欣赏库 网页制作 网页",
  "desc": "10万 读者检验，畅销书全新升级；10年开发教学经验，一线讲师半生心血。同属于HTML CSS JavaScript html5移动开发 html5实战 html5 canvas html5 app html5入门 html5 动画 html5揭秘 html 游戏 html5权威指南 网页制作 网页设计 网站建设 大类。 1． 体验好。 几乎每个章节都有二维码，微信扫一扫，可以随时随地看视频。 2． 资源多 从配套到拓展，资源库一应俱全。除了412节配套微视频和661个实例案例外。还提供如下学习资源： （1）习题及面试题库（共计1000题） （2）案例库（各类案例4396个） （3）工具库（HTML参考手册11部、CSS参考手册10部、JavaScript参考手册26部） （4）网页模板库（各类模板1636个） （5）网页素材库（17大类） （6）网页配色库（623项） （7）网页欣赏案例库（共计508例） 3．案例多 实例案例丰富详尽，达到412个，边做边学更快捷。跟着",
  "img_url": "http://img3m3.ddimg.cn/22/29/25108303-1_b_9.jpg",
  "price": "¥79.00"
}, {
  "id": "3j2796g4ff9ca",
  "title": "你不知道的JavaScript 上卷+中卷+下卷（套装共3册） JavaScript入门经典教程 深入了解ES6 探索JavaScript语言核心概念 展望JavaScript发展方向 深入挖掘JavaScript语言本质 简练形象地解释抽象概念 打通JavaSc",
  "desc": "JavaScript语言有很多复杂的概念，但却用简单的方式体现出来（比如回调函数），因此，JavaScript开发 者无需理解语言内部的原理，就能编写出功能全面的程序；就像收音机一样，你无需理解里面的管子和线圈都是做什么用的，只要会操作收音机上的按键，就可以收听你喜欢的节目。然而，JavaScript的这些复杂精妙的概念才是语言的精髓，即使是经验丰富的JavaScript开发 者，如果没有认真学习也无法真正理解语言本身的特性。正是因为绝大多数人不求甚解，一遇到出乎意料的行为就认为是语言本身有缺陷，进而把相关的特性加入黑名单，久而久之就排除了这门语言的多样性，人为地使它变得不完整、不安全。 你不知道的JavaScript 系列就是要让不求甚解的JavaScript开发 者迎难而上，深入语言内部，弄清楚JavaScript每一个零部件的用途。本书介绍了该系列的两个主题：",
  "img_url": "http://img3m8.ddimg.cn/61/27/27883708-1_b_3.jpg",
  "price": "¥142.80"
}, {
  "id": "a7bei1288ahb",
  "title": "JavaScript设计模式 百度前端专家力作 百度前端高级工程师鼎力推荐 web前端开发人员参考书 Web前端设计模式指南",
  "desc": "专业讲解全面Web前端设计模式书 ****、百度前端高级工程师鼎力推荐 Web前端界以一种讲故事方式讲解每一种模式，让每位读者都能读懂。 书中案例都是实际工作中的真实案例，让读者身临其境。 全面涵盖专门针对JavaScript的36个设计模式，帮助读者尽快提高开发效率 深入剖析面向对象的设计原则及代码重构，帮助读者快速融入团队项目开发中 本书通过职场主人公“小铭”实战历练，介绍了他从菜鸟到高级程序员的蜕变过程，值得每一个程序员借鉴和学习！ 各种设计模式的原则和准确定义、应用方法实践",
  "img_url": "http://img3m7.ddimg.cn/84/32/23753847-1_b_1.jpg",
  "price": "¥46.60"
}, {
  "id": "ffhfa1hea344",
  "title": "高性能JavaScript",
  "desc": "",
  "img_url": "http://img3m5.ddimg.cn/16/29/23762095-1_b_204.jpg",
  "price": "¥61.80"
}, {
  "id": "40bf9j5h84eg",
  "title": "JavaScript忍者秘籍 第2版 jQuery之父经典力作 JavaScript高手修炼指南 全面修订以涵盖ES6和ES7的概念 掌握跨浏览器开发教程书",
  "desc": "JavaScript 正以惊人的速度成为各种应用程序的通用语言，包括 Web、桌面、云和移动设备上的应用程序。当成为 JavaScript 专业kaifazhe时，你将拥有可应用于所有这些领域的、强大的技能集。 《JavaScript 忍者秘籍（第 2版）》使用实际的案例清晰地诠释每一个核心概念和技术。本书向读者介绍了如何掌握 JavaScript 核心的概念，诸如函数、闭包、对象、原型和 promise，同时还介绍了 JavaScript API， 包括 DOM、事件和计时器。你将学会测试、跨浏览器开发，所有这些都是JavaScriptkaifazhe应该掌握的技能。 本书包含以下内容： * 使用函数、对象和闭包编写更高效的代码； * 学会避免JavaScript应用陷阱； * 使用正则表达式编写简洁的文本处理代码； * 使用 promise 管理异步代码； * 全面修订以涵盖 ES6 和 ES7 的概念。 对任何学科的开发人员来说，本书都是应该阅读的书",
  "img_url": "http://img3m0.ddimg.cn/6/7/25234710-1_b_3.jpg",
  "price": "¥78.20"
}, {
  "id": "de25ii2ehi89",
  "title": "JavaScript与JSON从入门到精通（第2版） 全面、细致讲解JSON和JavaScript，书中实例极具参考价值并提供详尽的源代码分析！",
  "desc": "JSON和XML是较为流行的数据交换格式，在Web API、NoSQL数据库、服务端编程语言和客户端框架中都可以看到JSON的身影。在不同平台间的传递数据方面，JSON已成为XML强有力的替代者。与XML相比，JSON更加简洁且易于阅读，同时方便检查排错。另外，JSON更加轻量级，不管是编写、传输，还是解析都更加高效。JSON在传输过程中采用了压缩技术，因而更加节省带宽。*后，JSON还得到了众多语言的支持，如JavaScript、Python、C、C 等主流语言。",
  "img_url": "http://img3m6.ddimg.cn/80/32/27912536-1_b_3.jpg",
  "price": "¥78.30"
}, {
  "id": "chbc398406f1",
  "title": "JavaScript & jQuery 交互式Web前端开发",
  "desc": "《JavaScript jQuery 交互式Web前端开发》 学习内容 阅读和编写JavaScript代码 让网站更具交互性 使用jQuery简化代码 重现流行的Web技巧 涉及技术 幻灯片与灯箱效果 改进的表单与验证 使用Ajax、API和JSON 过滤、搜索与排序 在线支持 下载网址见书封底 代码示例 实践练习 其他参考资料",
  "img_url": "http://img3m7.ddimg.cn/62/19/25305947-1_b_1.jpg",
  "price": "¥87.80"
}, {
  "id": "gh044ag9g57i",
  "title": "了不起的JavaScript工程师：从前端到全端高级进阶 汇聚多年前端开发经验，覆盖JavaScript开发目前的热点领域，系统介绍前端开发工作中所需技能及工具，贴近国内开发者需求，阮一峰、张云龙等资深前端专家力荐",
  "desc": "★阮一峰、张云龙等资深前端专家力荐 ★涉及面广，适合用来了解和巩固前端开发技术全景 ★与国内开发实践紧密结合，贴近国内开发者的需求 ★还原了JavaScript在技术生态中 上下左右 所发挥作用 ★系统地介绍了前端开发工作中需要的技能及工具 ★从环境搭建、代码管理、Web流行趋势到后端开发调试 ★作者将多年丰富的前端开发经验都总结到本书中 ★可以提升工程师的视野扩展和技术应用格局 ★避免弯路，直接踏上 康庄大道 ★快速进入 全端 的境界",
  "img_url": "http://img3m4.ddimg.cn/84/31/27922044-1_b_3.jpg",
  "price": "¥75.80"
}, {
  "id": "0hjjfgidh3d39",
  "title": "JavaScript从入门到精通（微课视频版）（第2版） JavaScript本版图书扛鼎之作重磅升级！量身打造适合国内读者的本土化教学，31小时1860分钟全程视频教学，880个全程实例开发，赠网页模板库/素材库/配色库/习题库/面试题，提供在线答疑服务",
  "desc": "配套视频讲解：配备500集同步微视频讲解，手机、电脑均可观看，体验好。 示例案例丰富：880个示例案例，详细的示例设计过程和代码分析，可操作性强。 科学编写模式：采用 基础知识 中小示例 实战案例 的形式，可带领读者快读入门，符合科学学习规律。 拓展学习空间：丰富的拓展学习二维码，可以拓展学习范围。 配套资源丰富：配套视频 源文件 拓展学习资源库，方便你学习。 在线交流服务：QQ群在线交流服务，与小伙伴交流学习共同进步。作者也会不定时答疑解惑。",
  "img_url": "http://img3m8.ddimg.cn/77/34/27914018-1_b_3.jpg",
  "price": "¥87.80"
}, {
  "id": "2a81i5g959hbg",
  "title": "细说JavaScript语言",
  "desc": "本书内容是纯JavaScript语言部分，和浏览器无关，包括JavaScript基本语法、数据类型、流程控制、函数、对象、数组和内置对象，所有知识点都是为了学习DOM编程、Node.js、JS框架等JavaScript高级部分做准备。本书虽然是JavaScript的基础部分，但全书内容都需要牢牢掌握，才能更好地晋级学习。",
  "img_url": "http://img3m9.ddimg.cn/70/36/25187749-1_b_3.jpg",
  "price": "¥47.30"
}, {
  "id": "26ag728h7h074",
  "title": "JavaScript+Vue+React全程实例 通过JavaScript实例掌握Web前端开发技术",
  "desc": "JavaScript已经成为Web前端和服务器端都通用的一门脚本语言，同时为了提高开发效率，当前还流行使用Vue与React前端框架。本书从实例演示的角度出发，让读者通过实际案例学习语法，掌握技巧，积累经验，并能为深入理解目前流行的Web前端框架背后的原理打下基础。",
  "img_url": "http://img3m2.ddimg.cn/75/27/27901542-1_b_3.jpg",
  "price": "¥60.70"
}, {
  "id": "7f5ibhga8c9ad",
  "title": "JavaScript程序设计基础教程（慕课版）",
  "desc": "1030分钟精讲视频，详细讲解基础知识、行业应用、操作过程 一线项目研发、设计、管理工程师+极客学院、北风网金牌讲师详细讲解实战应用 43个任务案例边学边练，全面涵盖知识点 基础知识任务+每章实战案例+综合设计实例+综合实战，4步从零基础到JS达人 平台支撑，免费赠送资源 1.全部案例源代码、素材、*终文件 2.全书电子教案 3.人邮学院高清精讲视频课程 视频可扫书中二维码移动观看，也可以登录人邮学院（www.rymooc.com），注册登录后使用封底刮刮卡激活课程，在线观看。案例代码等资源可登陆人邮教育社区（www.ryjiaoyu.com.cn）下载使用。",
  "img_url": "http://img3m7.ddimg.cn/21/5/27892677-1_b_1.jpg",
  "price": "¥46.70"
}, {
  "id": "hbb41ia31hhi",
  "title": "JavaScript编程思想:从ES5到ES9 JavaScript编程从基础到实践,从ES5到ES9",
  "desc": "本书从基础到高级，介绍JavaScript的语法、概念以及从ES6到ES9的新特性 使用具有创意的示例讲解JavaScript的编程方法，提供详尽的代码注释 各章精心设计了丰富的编程练习题，便于读者检验学习效果",
  "img_url": "http://img3m8.ddimg.cn/36/19/27859428-1_b_2.jpg",
  "price": "¥103.80"
}, {
  "id": "hh36a1hedjag",
  "title": "JavaScript物联网硬件编程 一本组装设计机器人的电子电路速成教程，如何用电线连接传感器、安装电机、传送数据以及处理用户输入。",
  "desc": "你准备好了控制物体的移动吗？如果你可以开发一个Web app，就可以制作机器人、气象站以及其他有趣的设备。在这本非常有趣、基于项目的指南中，JavaScript硬件黑客Lyza Danger Gardner将带你领略从你的*个闪烁LED到大气传感器、电动巡游车、蓝牙门铃甚至更多项目的非凡之旅。通过使用JavaScript、一些随手可得的硬件，再加上一点创造力，你很快就能热火朝天地投入到硬件开发中。 《JavaScript物联网硬件编程》呈现小型硬件编程的神奇世界。你将从在Arduino上实现基本的闪烁开始，快速地上手构建项目。本书内容详实，拥有大量可以动手实践的项目，涵盖了多个JavaScript工具套件，例如Johnny-Five、Raspberry Pi、Tessel以及BeagleBone。在构建一个个有趣的项目之后，你将学会如何用电线连接传感器、安装电机、传送数据以及处理用户输入。因此在这里警告你：一旦你开始了，",
  "img_url": "http://img3m0.ddimg.cn/59/2/27931820-1_b_3.jpg",
  "price": "¥86.20"
}, {
  "id": "j0527h7bg0jc7",
  "title": "JavaScript入门经典(第5版)",
  "desc": "导语_点评_推荐词",
  "img_url": "http://img3m9.ddimg.cn/72/26/23843529-1_b_2.jpg",
  "price": "¥86.20"
}, {
  "id": "31jidd3d5b1c8",
  "title": "JavaScript 网页编程从入门到精通 Javascript 网页编程 入门热销 书籍 web 前端开发名作 478节同步视频讲解 166个实战案例 2个大型综合实战案例 380套网页模板 30部工具集 609项配色 13类设计素材 177",
  "desc": "网络开发视频大讲堂 丛书系清华社 视频大讲堂 重点大系之一。该大系包括多个子系列，每个子系列的图书在其同品种的图书中销售名列前茅，其中： 4个品种荣获 全行业热销品种 1个品种荣获2012年清华大学出版社 专业热销书 一等奖 绝大多数品种在 计算机零售图书排行榜 同品种排行中名列前茅 截至目前该大系累计销售超过55万册 该大系已成为近年来清华社计算机专业基础类零售图书热销的品牌之一 网络开发视频大讲堂 系列作为清华社 视频大讲堂 大系的子系列之一，继承和创新了清华社 视频大讲堂 大系的编写模式、写作风格和优良品质。本书突出了以下内容： 478节大型高清同步视频演示讲解，可反复观摩，让学习更为快捷 166个实战案例，通过实例学习更深入，更有趣，更有动力 2个大型综合实战案例，展现工作过程，积累工作经验 ◇实用",
  "img_url": "http://img3m4.ddimg.cn/38/16/25158314-1_b_6.jpg",
  "price": "¥103.80"
}, {
  "id": "3a1884a4j5c0j",
  "title": "JavaScript从入门到精通（第2版） 新版上市！javascript高级程序 权威指南 实战教程精粹 javascript dom编程艺术 前端开发 入门经典书籍 23小时视频 400个实例 369项面试真题 138项测试 ppt电子教案",
  "desc": "软件开发视频大讲堂 丛书系清华社 视频大讲堂 重点大系之一。该大系包括多个子系列，每个子系列的图书在其同品种的图书中销售名列前茅，其中：4个品种荣获 全行业优秀畅销品种 1个品种荣获2012年清华大学出版社 专业畅销书 一等奖绝大多数品种在 全国计算机零售图书排行榜 同品种排行中名列前茅截至目前该大系累计销售超过130万册该大系已成为近年来清华社计算机专业基础类零售图书畅销品牌之一 软件开发视频大讲堂 系列作为清华社 视频大讲堂 大系的子系列之一，继承和创新了清华社 视频大讲堂 大系的编写模式、写作风格和优良品质。本书突出了以下内容：总长总时长23小时同步视频演示讲解，可反复观摩，让学习更为快捷、高效400个典型实例，通过实例学习更深入，更有趣，更有动力369道面试真题，了解工作实例及面试问题，更好适应企",
  "img_url": "http://img3m1.ddimg.cn/49/27/25092391-1_b_3.jpg",
  "price": "¥70.20"
}]

// eslint-disable-next-line import/prefer-default-export
export {
  childrenBooks,
  technology,
}
